app/controllers/admin/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "お菓子類/"], ["updated_at", "2021-12-06 15:45:59.894058"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)

SELECT "genres".* FROM "genres"
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-12-15 22:05:48.071838"], ["updated_at", "2021-12-15 22:05:48.071838"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genres = Genre.all
    @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 40]]
---
  def destroy
    @genre = Genre.find(params[:id])
    @genres = Genre.all
    @genre.destroy