app/views/public/relationships/_relationship.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["followed_id", 2], ["follow_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% if Relationship.find_by(followed_id: food.user.id, follow_id: current_user.id).present? %>