app/views/public/relationships/followed.html.erb

          <td><%= f.name %></td>
          <td>( <%= Food.where(user_id: f.id).count %> )</td>
---
SELECT COUNT(*) FROM "foods" WHERE "foods"."user_id" = ?  [["user_id", 1]]