app/views/public/foods/edit.html.erb

          <datalist id='food_name_list'>
            <% FoodName.all.each do |n| %>
---
SELECT "food_names".* FROM "food_names"

          <datalist id='compound_list'>
            <% Compound.all.each do |c| %>
---
SELECT "compounds".* FROM "compounds"

        <%= f.text_area :comment %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>
---
SELECT "food_names".* FROM "food_names"
SELECT "genres".* FROM "genres"