app/views/public/foods/show.html.erb

SELECT "compounds".* FROM "compounds"
---

<% Compound.all.each do |c| %>