app/views/public/foods/show.html.erb

        <tbody>
          <% if Favorite.find_by(food_id: @food.id, user_id: current_user.id).present? %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."food_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["food_id", 1], ["user_id", 2], ["LIMIT", 1]]

            <tr><td><%= @food.rate %></td><td><%= @food.created_at.strftime("%Y/%m/%d") %></td><td><%= @food.user.name %></td>
              <% if Relationship.find_by(followed_id: @food.user.id, follow_id: current_user.id).present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["followed_id", 1], ["follow_id", 2], ["LIMIT", 1]]


<% FoodName.all.each do |fn| %>
---
SELECT "food_names".* FROM "food_names"


<% Food.where(food_name_id: 3).each do |f| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."food_name_id" = ?  [["food_name_id", 2]]