app/views/public/homes/_side_bar.html.erb

<div class="side_bar">
  <% Genre.all.each do |genre| %>
---
SELECT "genres".* FROM "genres"

    <% genre.genre_food_names.each do |food_name| %>
      <div class="ml-2 small"><%= food_name.name %>( <%= food_name.foods.count %> )<br></div> <%# link_to name->search %>
---
SELECT COUNT(*) FROM "foods" WHERE "foods"."food_name_id" = ?  [["food_name_id", 2]]