app/views/public/homes/top.html.erb

SELECT AVG("foods"."rate") FROM "foods" WHERE "foods"."food_name_id" = ?  [["food_name_id", 2]]
---
        <%= n.food_name.name %>
        <%= Food.where(food_name_id: n.food_name_id).average(:rate).round(1) %>