app/controllers/public/favorites_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "food_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["food_id", 6], ["created_at", "2021-12-15 20:28:57.067225"], ["updated_at", "2021-12-15 20:28:57.067225"]]
---
  def create
    @food = Food.find(params[:id])
    Favorite.create(user_id: current_user.id, food_id: params[:id])

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 15]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."food_id" = ? LIMIT ?  [["user_id", 2], ["food_id", 3], ["LIMIT", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    Favorite.find_by(user_id: current_user.id, food_id: params[:id]).destroy