app/controllers/public/foods_controller.rb

  def update
    @food = Food.find(params[:id])
    if @food.update(food_params) && FoodName.find(@food.food_name_id).update(food_name_params) && Compound.find(@food.compound_id).update(compound_params)
---
SELECT  "compounds".* FROM "compounds" WHERE "compounds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]