app/controllers/public/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = ?  [["user_id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."food_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["food_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods"
SELECT DISTINCT "foods"."food_name_id" FROM "foods" WHERE "foods"."user_id" = ?  [["user_id", 1]]
---
  def index
    case params[:id]
    when "followed"
      @foods = Food.where(user_id: params[:user])
    when "current"
      @foods = Food.where(user_id: current_user.id)
    when "favorite"
      @foods = current_user.favorite_foods
    else
      @foods = Food.all
    end
    @food_names = FoodName.where(id: @foods.select(:food_name_id).distinct.pluck(:food_name_id)).page(params[:page]).per(15)

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "food_names".* FROM "food_names" WHERE "food_names"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "compounds".* FROM "compounds" WHERE "compounds"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "food_names".* FROM "food_names" WHERE "food_names"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @food = Food.find(params[:id])
    @food_name = FoodName.find(@food.food_name_id)
    @compound = Compound.find(@food.compound_id)

INSERT INTO "foods" ("food_name_id", "genre_id", "user_id", "function", "comment", "rate", "created_at", "updated_at", "compound_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "foods" SET "comment" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["comment", "おいしい?"], ["updated_at", "2021-12-09 02:41:38.194659"], ["id", 4]]
UPDATE "food_names" SET "name" = ?, "updated_at" = ? WHERE "food_names"."id" = ?  [["name", "imuse"], ["updated_at", "2021-12-09 03:14:11.199183"], ["id", 9]]
INSERT INTO "food_names" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ボディメンテ"], ["created_at", "2021-12-12 16:28:46.897991"], ["updated_at", "2021-12-12 16:28:46.897991"]]
UPDATE "compounds" SET "name" = ?, "updated_at" = ? WHERE "compounds"."id" = ?  [["name", "プラズマ乳酸菌2"], ["updated_at", "2021-12-09 02:44:45.944361"], ["id", 9]]
INSERT INTO "compounds" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "乳酸菌"], ["created_at", "2021-12-12 15:50:12.687290"], ["updated_at", "2021-12-12 15:50:12.687290"]]
INSERT INTO "compounds" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "リコピン"], ["created_at", "2021-12-19 07:03:43.334138"], ["updated_at", "2021-12-19 07:03:43.334138"]]
SELECT "food_names".* FROM "food_names"
SELECT  1 AS one FROM "food_names" WHERE "food_names"."name" = ? LIMIT ?  [["name", "ヤクルト"], ["LIMIT", 1]]
SELECT "compounds".* FROM "compounds"
SELECT  1 AS one FROM "compounds" WHERE "compounds"."name" = ? LIMIT ?  [["name", "リコピン"], ["LIMIT", 1]]
DELETE FROM "food_compounds" WHERE "food_compounds"."id" = ?  [["id", 2]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 3]]
---
  def create
    @food = Food.new(food_params)
    @food_name = FoodName.find_by(name: params[:food_name][:name]) # field for
    @compound = Compound.find_by(name: params[:compound][:name]) # field for

    if @food_name.nil?
      @food_name = FoodName.new(food_name_params)
      @food_name.save
    end
      @food.food_name_id = @food_name.id
    if @compound.nil?
      @compound = Compound.new(compound_params)
      @compound.save
    end
      @food.compound_id = @compound.id
    @food.user_id = current_user.id if user_signed_in?
    if @food.save
      if @food.image.present? && !@food.safe_image? # Vision API/SafeSearch
        File.delete("#{Rails.root}/public/uploads/#{@food.image.id}")

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "food_names".* FROM "food_names" WHERE "food_names"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "food_names" SET "name" = ?, "updated_at" = ? WHERE "food_names"."id" = ?  [["name", "imuse"], ["updated_at", "2021-12-09 03:14:11.199183"], ["id", 9]]
UPDATE "foods" SET "image_id" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["image_id", nil], ["updated_at", "2021-12-19 21:55:47.993159"], ["id", 1]]
SELECT  1 AS one FROM "food_names" WHERE "food_names"."name" = ? AND "food_names"."id" != ? LIMIT ?  [["name", "トマト"], ["id", 1], ["LIMIT", 1]]
SELECT  "compounds".* FROM "compounds" WHERE "compounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "compounds" SET "name" = ?, "updated_at" = ? WHERE "compounds"."id" = ?  [["name", "プラズマ乳酸菌2"], ["updated_at", "2021-12-09 02:44:45.944361"], ["id", 9]]
SELECT  1 AS one FROM "compounds" WHERE "compounds"."name" = ? AND "compounds"."id" != ? LIMIT ?  [["name", "リコピン"], ["id", 1], ["LIMIT", 1]]
---
  def update
    @food = Food.find(params[:id])
    @food_name = FoodName.find_by(name: params[:food_name][:name]) # field for
    @compound = Compound.find_by(name: params[:compound][:name]) # field for

    if @food_name.nil? && Food.where(food_name_id: @food.food_name.id).one? # 単一データ->新規
      @food.food_name.update(food_name_params)
    elsif @food_name.nil? # 新規
      @food_name = FoodName.new(food_name_params)
      @food_name.save
    elsif Food.where(food_name_id: @food.food_name.id).one? # 単一データ->既存
      @food_name_before = @food.food_name
    end
    @food.food_name_id = @food_name.id if @food_name.present?
    if @compound.nil? && Food.where(compound_id: @food.compound.id).one?
      @food.compound.update(compound_params)
    elsif @compound.nil?
      @compound = Compound.new(compound_params)
      @compound.save
    elsif Food.where(compound_id: @food.compound.id).one?
      @compound_before = @food.compound
    end
      @food.compound_id = @compound.id if @compound.present?

DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 2]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    if Food.find(params[:id]).destroy