app/controllers/public/food_names_controller.rb

  def show
    @food_name = FoodName.find(params[:id])
---
SELECT  "food_names".* FROM "food_names" WHERE "food_names"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]