app/controllers/public/homes_controller.rb

  def top
    @new = Food.order(created_at: :desc).limit(3)
---
SELECT  "foods".* FROM "foods" ORDER BY "foods"."created_at" DESC LIMIT ?  [["LIMIT", 3]]