app/controllers/public/relationships_controller.rb

  def create
    @food = Food.find(params[:id])
    Relationship.create(followed_id: @food.user_id, follow_id: current_user.id)
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("follow_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follow_id", 2], ["followed_id", 1], ["created_at", "2021-12-15 21:16:39.299269"], ["updated_at", "2021-12-15 21:16:39.299269"]]

  def destroy
    @food = Food.find(params[:id])
    Relationship.find_by(followed_id: @food.user_id, follow_id: current_user.id).destroy
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 5]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["followed_id", 1], ["follow_id", 2], ["LIMIT", 1]]