app/controllers/public/searchs_controller.rb

SELECT "food_names".* FROM "food_names" WHERE (name LIKE '%&{params[:word]}%') ORDER BY "food_names"."created_at" DESC
SELECT "food_names".* FROM "food_names" WHERE (name LIKE '%ヤクルト%') ORDER BY "food_names"."created_at" DESC
SELECT COUNT(*) FROM "foods" WHERE (function LIKE '%免疫%')
SELECT "compounds".* FROM "compounds" WHERE (name LIKE '%免疫%') ORDER BY "compounds"."created_at" DESC
SELECT COUNT(*) FROM "foods" WHERE "foods"."compound_id" = ?  [["compound_id", 6]]
SELECT DISTINCT "food_name_id" FROM "compounds" INNER JOIN "foods" ON "foods"."compound_id" = "compounds"."id" WHERE (name LIKE '%乳酸菌%') ORDER BY "compounds"."created_at" DESC
SELECT "foods".* FROM "foods" WHERE "foods"."compound_id" IN (?, ?, ?, ?)  [["compound_id", 6], ["compound_id", 5], ["compound_id", 4], ["compound_id", 3]]
SELECT DISTINCT "compounds"."name" FROM "compounds" INNER JOIN "foods" ON "foods"."compound_id" = "compounds"."id" INNER JOIN "food_names" ON "food_names"."id" = "foods"."food_name_id" WHERE (name LIKE '%イミューズ%') ORDER BY "compounds"."created_at" DESC
SELECT "foods".* FROM "foods" WHERE (function LIKE '%免疫%') ORDER BY "foods"."created_at" DESC
SELECT COUNT(*) FROM "food_names" WHERE (name LIKE '%&{params[:word]}%')
---
  def search
    case params[:id]
      when "name"
        @search_names = FoodName.where('name LIKE ?', "%#{params[:word]}%").order(created_at: :desc)
        @search_count = 0
        @search_names.each do |name|
          @search_count += name.foods.count
        end
      when "compound"
        @search = Compound.where('name LIKE ?', "%#{params[:word]}%").order(created_at: :desc)
        @search_count = 0
        @search.each do |compound|
          @search_count += compound.foods.count
        end
        @search_names = FoodName.where(id: @search.joins(:foods).select(:food_name_id).distinct.pluck(:food_name_id))
        @search_foods = Food.where(compound_id: @search.ids)

      when "function"
        @search_foods = Food.where('function LIKE ?', "%#{params[:word]}%").order(created_at: :desc)
        @search_names = @search_foods.of_food_names
        @search_count = @search_foods.count