app/controllers/public/searchs_controller.rb

SELECT DISTINCT "foods"."food_name_id" FROM "foods" WHERE (function LIKE '%免疫%') ORDER BY "foods"."created_at" DESC
---
  def search
    case params[:id]
    when "name"
      @search_names = FoodName.where('name LIKE ?', "%#{params[:word]}%").order(created_at: :desc)
      @search_foods = Food.where(food_name_id: @search_names.ids).order(created_at: :desc)
      @search_count = @search_foods.count

    when "compound"
      @search = Compound.where('name LIKE ?', "%#{params[:word]}%")
      @search_names = @search.joins(:foods).select(:food_name_id).distinct.pluck(:food_name_id)
      @search_names = FoodName.where(id: @search_names).order(created_at: :desc)