app/views/public/favorites/_favorite.html.erb

<% if Favorite.find_by(food_id: food.id, user_id: current_user.id).present? %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."food_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["food_id", 3], ["user_id", 2], ["LIMIT", 1]]