app/views/public/searchs/search.html.erb

              <tbody>
                <% if Favorite.find_by(food_id: food.id, user_id: current_user.id).present? %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."food_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["food_id", 1], ["user_id", 2], ["LIMIT", 1]]

                  <tr><td><%= food.rate %></td><td><%= food.created_at.strftime("%Y/%m/%d") %></td><td><%= food.user.name %></td>
                    <% if Relationship.find_by(followed_id: food.user.id, follow_id: current_user.id).present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["followed_id", 1], ["follow_id", 2], ["LIMIT", 1]]

          <tbody>
            <% if Favorite.find_by(food_id: food.id, user_id: current_user.id).present? %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."food_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["food_id", 8], ["user_id", 2], ["LIMIT", 1]]

              <tr><td><%= food.rate %></td><td><%= food.created_at.strftime("%Y/%m/%d") %></td><td><%= food.user.name %></td>
                <% if Relationship.find_by(followed_id: food.user.id, follow_id: current_user.id).present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["followed_id", 2], ["follow_id", 2], ["LIMIT", 1]]

<%= f.text_field :word, placeholder:"検索ワード" %>
<%= f.select :id, { '名前': 'name', '成分名': 'compound', '機能': 'function' }, { include_blank: '選択してください' }, { class: 'form-control', required: true } %>
---
SELECT "compounds"."id" AS t0_r0, "compounds"."name" AS t0_r1, "compounds"."created_at" AS t0_r2, "compounds"."updated_at" AS t0_r3, "food_names"."id" AS t1_r0, "food_names"."name" AS t1_r1, "food_names"."created_at" AS t1_r2, "food_names"."updated_at" AS t1_r3 FROM "compounds" LEFT OUTER JOIN "foods" ON "foods"."compound_id" = "compounds"."id" LEFT OUTER JOIN "food_names" ON "food_names"."id" = "foods"."food_name_id" WHERE (name LIKE '%イミューズ%') ORDER BY "compounds"."created_at" DESC
SELECT "food_names".* FROM "food_names" WHERE (name LIKE '%&{params[:word]}%') ORDER BY "food_names"."created_at" DESC