app/models/food_name.rb

SELECT AVG("foods"."rate") FROM "foods" WHERE "foods"."food_name_id" = ?  [["food_name_id", 1]]
---
  def average_rate
    Food.where(food_name_id: id).average(:rate).round(1)