app/models/food.rb

    def self.of_food_name_list
        food_names = []
        self.select(:food_name_id).distinct.each do |f|
---
SELECT DISTINCT "foods"."food_name_id" FROM "foods" WHERE (function LIKE '%免疫%') ORDER BY "foods"."created_at" DESC